Revit 2026 API

# LightShapeStyle Enumeration

---

Tags for specific light shape styles

**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum LightShapeStyle
```
```vb
Public Enumeration LightShapeStyle
```
```cpp
public enum class LightShapeStyle
```
```fsharp
type LightShapeStyle
```

| Member name | Value | Description |
| --- | --- | --- |
| Circle | 3 | Circular light shape. |
| Line | 1 | Line light shape. |
| Point | 0 | Point light shape. |
| Rectangle | 2 | Rectangular light shape. |

#### Reference

Autodesk.Revit.DB.Lighting Namespace